rules.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Regras</title>
<!-- 2021-03-20 Sat 09:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Manoel Vilela, Lucas S. Vieira" />
<link rel="stylesheet" type="text/css" href="/org-theme/dist/short/bundle.css"/>
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
</head>
<body>
<div id="content">
<h1 class="title">Regras</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Que grupo é esse?</a></li>
<li><a href="#sec-2">2. Quais são as regras?</a></li>
<li><a href="#sec-3">3. Sobre banimentos automáticos</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Que grupo é esse?</h2>
<div class="outline-text-2" id="text-1">
<p>
A <b>Common Lisp Brasil</b> é uma  comunidade brasileira, que tem o Português
como  língua  principal,  e  que  promove  discussões  a  respeito  da
linguagem  de programação  Common Lisp,  além de  outras linguagens  e
dialetos relacionados a ela.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Quais são as regras?</h2>
<div class="outline-text-2" id="text-2">
<p>
As  "regras"  a  seguir  são  linhas  gerais  para  garantir  uma  boa
convivência na nossa comunidade de Common Lisp.
</p>

<p>
Não costumamos impor regras  restritivas, e procuramos fazê-lo somente
para garantir que a comunidade seja um bom ambiente de discussões.
</p>

<p>
Seguem algumas sugestões para a  boa convivência. Quando em dúvida, os
moderadores lidarão com a situação, e poderão ampliar este texto.
</p>

<ol class="org-ol">
<li>Trate a todos com respeito  e, assim, seja respeitado. Nunca assuma
que um comentário tem a  intenção de ofender; a moderação intervirá
sempre que isso não ocorrer.
</li>
<li>Não poste <i>spam</i>. Nunca.
<ul class="org-ul">
<li>Qualquer assunto relacionado poderá  ser abordado, mas sempre que
uma  discussão  sobre Lisp  estiver  em  curso, abordar  qualquer
assunto divergente será considerado impertinente.
</li>
</ul>
</li>
<li>Não há tolerância para <i>trolls</i>. Portanto, não os alimente.
</li>
<li>Divulgações são  toleradas para  membros engajados,  mas promover
conteúdo  não-relacionado   ao  tema  da  comunidade   será  sempre
mal-visto.
</li>
</ol>

<p>
Os moderadores  zelam pelo  bem-estar da  comunidade. Caso  você cause
algum problema,  poderá receber um  aviso (dependendo da  gravidade da
ofensa).  Caso haja  um problema  grave ou  houver reincidência,  você
poderá ser banido imediatamente.
</p>

<p>
Aproveite nossa comunidade para aprender  e discutir Common Lisp!  Não
faz  sentido você  participar do  grupo se  não vai  explorar uma  das
melhores linguagens que existem, não é mesmo?
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Sobre banimentos automáticos</h2>
<div class="outline-text-2" id="text-3">
<p>
Durante a pandemia global de 2020,  grupos de <i>trolls</i> acharam que seria
divertido redirecionar  pessoas para entrarem  em nosso grupo.  Como a
maioria  das pessoas  nunca lê  as regras  ou descrições  de um  grupo
(aliás, parabéns por  ler até aqui), muitos novos  membros entraram no
grupo  Common Lisp  Brasil em  busca de  cartões de  crédito clonados,
resoluções  de  exercícios  de   faculdade  em  outras  linguagens  de
programação, e outros pedidos muitas vezes ilegais e/ou que nada têm a
ver com Lisp.
</p>

<p>
Por conta disso, poderemos usar nosso bot de banimento automático, que
banirá qualquer participante de grupos que consideremos como fontes de
<i>trolls</i>.
</p>

<p>
Caso você  seja banido e queira  recorrer da decisão, converse  com os
moderadores em privado.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-09-20 dom&gt;</span></span></p>
<p class="author">Author: Manoel Vilela, Lucas S. Vieira</p>
<p class="date">Created: 2021-03-20 Sat 09:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
